app/views/recipes/show.html.erb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 9]]
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 1]]
---
        <table>
          <% @recipe.recipe_ingredients.each do |ingredient| %>

SELECT "recipe_steps".* FROM "recipe_steps" WHERE "recipe_steps"."recipe_id" = ?  [["recipe_id", 1]]
---
    <h4>作り方</h4>
    <% @recipe.recipe_steps.each do |step| %>