app/views/users/show.html.erb

SELECT COUNT(*) FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]
---
              <td><%= follow.introduction %></td>
              <td>レシピ <%= follow.recipes.count %> 件</td>