app/controllers/comments_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "user_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "とっても美味しそうだね"], ["user_id", 2], ["recipe_id", 6], ["created_at", "2020-11-09 08:08:37.167174"], ["updated_at", "2020-11-09 08:08:37.167174"]]
---
  def create
    recipe = Recipe.find(params[:recipe_id])
    comment = current_user.comments.new(comment_params)
    comment.recipe_id = recipe.id
    comment.save