app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("title", "body", "recipe_image_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user_id = current_user.id
    if @recipe.save

SELECT  "recipes".* FROM "recipes" ORDER BY "recipes"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "recipes"
---
  def index
    @recipes = Recipe.page(params[:page]).reverse_order

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = ?  [["recipe_id", 18]]
---
  def show
    @recipe = Recipe.find(params[:id])
    @user = User.find_by(id: @recipe.user_id)
    @comment = Comment.new
    @comments = Comment.where(recipe_id: @recipe.id)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "recipes" SET "recipe_image_id" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["recipe_image_id", "fb8c66e9933060997688f92552ac4ebcef0e2695a0f35a2a456222645e91"], ["updated_at", "2020-11-11 04:53:03.165934"], ["id", 19]]
---
  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.update(recipe_params)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 16]]
---
  def destroy
    recipe = Recipe.find(params[:id])
    recipe.destroy