app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @myRecipes = Recipe.where(user_id: @user.id)
    @recipes=@myRecipes.page(params[:page]).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ? ORDER BY "recipes"."id" DESC LIMIT ? OFFSET ?  [["user_id", 3], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "recipes" WHERE "recipes"."user_id" = ? ORDER BY "recipes"."id" DESC LIMIT ? OFFSET ?) subquery_for_count  [["user_id", 3], ["LIMIT", 5], ["OFFSET", 0]]

  def update
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "user_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["user_image_id", "8114880a191f34ad7bef9912835a5838ed00e1058e4db2fc6a9d6a3fc513"], ["introduction", "カントリーベアバンドのリーダー"], ["updated_at", "2020-11-23 04:44:46.245703"], ["id", 1]]