app/models/user.rb

  def follow(user_id)
    active_relationships.create(followed_id: user_id)
---
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["followed_id", 1], ["created_at", "2020-11-23 05:00:58.885502"], ["updated_at", "2020-11-23 05:00:58.885502"]]

  def unfollow(user_id)
    active_relationships.find_by(followed_id: user_id).destroy
---
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 2]]